ethereumTestBasic.yml
config:
  target: "https:/"
  phases:
    - duration: 2
      arrivalRate: 2
  processor: "./signer.js"
scenarios:
    - flow:
      - post:
          url: "/rinkeby.infura.io/v3/e744cbc3502b48508063c77ab5a8389f"
          beforeRequest: "createRawTx"
          afterResponse: "logBody"
          json:
            jsonrpc: "2.0"
            method: "eth_sendRawTransaction"
            params: ["{{ rawTx }}"]
            id: 73