ethereumTestConfirmed.yml
config:
  target: "http:/"
  phases:
    - duration: 4
      arrivalRate: 4
  processor: "./signer.js"
scenarios:
    - flow:
      - post:
          url: "/localhost:8545"
          beforeRequest: "createRawTx"
          afterResponse: "logBody"
          json:
            jsonrpc: "2.0"
            method: "eth_sendRawTransaction"
            params: ["{{ rawTx }}"]
            id: 73
          capture:
            json: $.result
            as: txHash
      - post:
          url: "/localhost:8545"
          beforeRequest: "waitForTx"
          afterResponse: "logBodyForReceipt"
          json:
            jsonrpc: "2.0"
            method: "eth_getTransactionReceipt"
            params: ["{{ txHash }}"]
            id: 74